MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_exti.c
/**
  *********************************************************************************************************************
  * @file    stm32c5xx_hal_exti.c
  * @brief   EXTI HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionality of the General Purpose Input/Output (EXTI) peripheral:
  *           + Initialization and de-initialization functions
  *           + I/O operation functions
  *
  *********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *********************************************************************************************************************
  */

/* Includes ---------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (EXTI)
#if defined (USE_HAL_EXTI_MODULE) && (USE_HAL_EXTI_MODULE == 1)

/** @addtogroup EXTI
  * @{
  */

/** @defgroup EXTI_Introduction EXTI Introduction
  * @{

   The EXTI hardware abstraction layer provides a set of APIs to interface with the EXTI peripheral
   on STM32 microcontrollers.

   The EXTI peripheral manages each line (configurable and direct) using a state machine per line.
   The EXTI includes the following features:

   - Initialize a line.
   - Configure a line.
   - Enable a line in a specific mode (interrupt or event).
   - Force a software interrupt on a specific line.
   - Manage interrupts for a specific line.

  This abstraction layer guarantees portability and ease of use across different STM32 series.
  */

/**
  * @}
  */
/** @defgroup EXTI_How_To_Use EXTI How To Use
  * @{

# How to use the EXTI HAL module driver

## The EXTI HAL driver can be used as follows:

## When a configurable EXTI line is used as an event input:
  - Instantiate an EXTI handle and associate it to a configurable EXTI line using HAL_EXTI_Init().
  - Configure the configurable EXTI line identified by the given handle using HAL_EXTI_SetConfig().
  - Register a user-defined callback for the configurable EXTI line identified by the handle
  using HAL_EXTI_RegisterTriggerCallback(), or use the default callback function HAL_EXTI_TriggerCallback().
  - Enable the configurable EXTI line for interrupt, event, or both modes using HAL_EXTI_Enable().
  - Retrieve pending events for the configurable EXTI line using HAL_EXTI_GetPending() and clear them
  using HAL_EXTI_ClearPending().
  - Disable EXTI modes using HAL_EXTI_Disable().

## When a direct EXTI line is used as an event input:
  - Instantiate an EXTI handle and associate it to a direct EXTI line using HAL_EXTI_Init().
  - Enable the direct EXTI line for interrupt, event, or both modes using HAL_EXTI_Enable().
  - Disable EXTI modes using HAL_EXTI_Disable().
## When generating a software interrupt on an EXTI line:
  - Instantiate an EXTI handle and associate it to an EXTI line using HAL_EXTI_Init().
  - Register a user-defined callback for an EXTI line identified by the handle
  using HAL_EXTI_RegisterTriggerCallback(), or use the default callback function HAL_EXTI_TriggerCallback()
  - Generate the software interrupt using HAL_EXTI_GenerateSWI().
  - Retrieve pending software interrupt events using HAL_EXTI_GetPending() and clear them
  using HAL_EXTI_ClearPending().

## The HAL EXTI driver allows management of EXTI security attributes:
  - Set the privilege access level attribute for an EXTI line using HAL_EXTI_SetPrivAttr().
  - Get the privilege access level attribute for an EXTI line using HAL_EXTI_GetPrivAttr().

## The HAL EXTI driver allows to get the state and instance of lines:
  - Get the current general state of the EXTI line using HAL_EXTI_GetState().
  - Get the HAL EXTI line using HAL_EXTI_GetInstance().
  - Get the LL EXTI line using HAL_EXTI_GetLLInstance().
  */

/**
  * @}
  */

/** @defgroup EXTI_Configuration_Table EXTI Configuration Table
  * @{
# Configuration inside the EXTI driver

Config defines                  | Description     | Default value | Note
--------------------------------|-----------------|---------------|------
USE_ASSERT_DBG_PARAM            | from IDE        | None          | Enables parameter assertions when defined
USE_ASSERT_DBG_STATE            | from IDE        | None          | Enables state assertions when defined
USE_HAL_CHECK_PARAM             | from hal_conf.h | 0             | Parameters such as pointers are checked at runtime
USE_HAL_EXTI_MODULE             | from hal_conf.h | 1             | If defined, stm32c5xx_hal_exti.h is included
USE_HAL_EXTI_REGISTER_CALLBACKS | from hal_conf.h | 0             | If defined, EXTI register callbacks are enabled
USE_HAL_EXTI_USER_DATA          | from hal_conf.h | 0             | If defined, allows the use of user data
CMSE_SECURE_EXECUTION_ENVIRONMENT| from stm32tnxx.h |        NA       | Defined in secure context
  */
/**
  * @}
  */

/* Private constants ------------------------------------------------------------------------------------------------*/
/** @defgroup EXTI_Private_Constants EXTI Private Constants
  * @{
  */

/**
  * @brief  EXTI Mask for GPIO PIN.
  */
#define EXTI_PIN_MASK (LL_EXTI_PIN_MASK | LL_EXTI_CR4)
/**
  * @}
  */

/* Private macros ---------------------------------------------------------------------------------------------------*/
/** @defgroup EXTI_Private_Macros EXTI Private Macros
  * @{
  */
/*! Check if GPIO line or configurable line or direct line and check line number is within range */
#define IS_EXTI_LINE(line) \
  ((((line) & ~(LL_EXTI_PROPERTY_MASK | LL_EXTI_PIN_MASK | LL_EXTI_REG_MASK | LL_EXTI_CR4)) == 0x00U)  \
   && ((((line) & LL_EXTI_PROPERTY_MASK) == LL_EXTI_CONFIG) \
       || (((line) & LL_EXTI_PROPERTY_MASK) == LL_EXTI_GPIO) \
       || (((line) & LL_EXTI_PROPERTY_MASK) == LL_EXTI_DIRECT)) \
   && (((line) & LL_EXTI_PIN_MASK) < LL_EXTI_LINE_NB))

/*! Macro to check EXTI mode */
#define IS_EXTI_MODE(mode) (((mode) == HAL_EXTI_MODE_INTERRUPT) \
                            || ((mode) == HAL_EXTI_MODE_EVENT) \
                            || ((mode) == HAL_EXTI_MODE_INTERRUPT_EVENT))

/*! Macro to check EXTI trigger */
#define IS_EXTI_TRIGGER(trigger) (((trigger) == HAL_EXTI_TRIGGER_NONE) \
                                  || ((trigger) == HAL_EXTI_TRIGGER_RISING) \
                                  || ((trigger) == HAL_EXTI_TRIGGER_FALLING) \
                                  || ((trigger) == HAL_EXTI_TRIGGER_RISING_FALLING))

/*! Macro to check EXTI pending edge */
#define IS_EXTI_PENDING_EDGE(pending_edge)   (((pending_edge) == HAL_EXTI_TRIGGER_RISING) \
                                              || ((pending_edge) == HAL_EXTI_TRIGGER_FALLING) \
                                              || ((pending_edge) == HAL_EXTI_TRIGGER_RISING_FALLING))

/*! Macro to check EXTI GPIO port */
#if defined(GPIOF)
#define IS_EXTI_GPIO_PORT(port)     (((port) == HAL_EXTI_GPIOA) \
                                     || ((port) == HAL_EXTI_GPIOB) \
                                     || ((port) == HAL_EXTI_GPIOC) \
                                     || ((port) == HAL_EXTI_GPIOD) \
                                     || ((port) == HAL_EXTI_GPIOE) \
                                     || ((port) == HAL_EXTI_GPIOF) \
                                     || ((port) == HAL_EXTI_GPIOG) \
                                     || ((port) == HAL_EXTI_GPIOH))
#else
#define IS_EXTI_GPIO_PORT(port)     (((port) == HAL_EXTI_GPIOA) \
                                     || ((port) == HAL_EXTI_GPIOB) \
                                     || ((port) == HAL_EXTI_GPIOC) \
                                     || ((port) == HAL_EXTI_GPIOD) \
                                     || ((port) == HAL_EXTI_GPIOE) \
                                     || ((port) == HAL_EXTI_GPIOH))
#endif /* GPIOI */

/*! Macro to check EXTI configurable line */
#define IS_EXTI_CONFIG_LINE(line)    (((line) & LL_EXTI_CONFIG) == LL_EXTI_CONFIG)

/*! Macro to check the EXTI privilege attributes */
#define IS_EXTI_LINE_PRIV_ATTR(attribute) ((attribute == HAL_EXTI_PRIV) || (attribute == HAL_EXTI_NPRIV))
/**
  * @}
  */

/* Exported functions -----------------------------------------------------------------------------------------------*/
/** @addtogroup EXTI_Exported_Functions
  * @{
  */

