MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_exti.c
/** @addtogroup EXTI_Exported_Functions_Group1
  * @{
  * ## This subsection provides a set of functions to initialize, de-initialize, and configure the EXTI:

### Initialize the EXTI handle using HAL_EXTI_Init():
  - Provide the EXTI handle as a parameter.
  - Provide the EXTI line number as a second parameter from \ref hal_exti_line_t enumeration.

### De-initialize the EXTI and reset the EXTI global state to HAL_EXTI_STATE_RESET by calling HAL_EXTI_DeInit():
  - Provide the EXTI handle as a parameter.

### Configure the EXTI line using HAL_EXTI_SetConfig():
  - Provide the EXTI handle as a parameter.
  - Provide a configuration containing the trigger edge from \ref hal_exti_trigger_t and the gpio_port from
  \ref hal_exti_gpio_port_t.

### Retrieve the current EXTI configuration of a dedicated line using HAL_EXTI_GetConfig():
  - Provide the EXTI handle as the first parameter.
  - Provide a configuration structure used to retrieve the current EXTI line configuration. \n
<br>
  */

/**
  * @brief  Store the EXTI line into the handle.
  * @param hexti Pointer to EXTI handle.
  * @param line EXTI line. This parameter can be one of the values of @ref hal_exti_line_t.
  * @retval HAL_INVALID_PARAM In case of an invalid parameter.
  * @retval HAL_OK In case of a successful initialization.
  */
hal_status_t HAL_EXTI_Init(hal_exti_handle_t *hexti, hal_exti_line_t line)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM(IS_EXTI_LINE((uint32_t)line));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hexti == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Store EXTI line into handle */
  hexti->line = line;

  /* Compute the corresponding LL EXTI line needed for LL functions */
  hexti->ll_line = (1UL << ((uint32_t)hexti->line & LL_EXTI_PIN_MASK));

#if defined (USE_HAL_EXTI_REGISTER_CALLBACKS) && (USE_HAL_EXTI_REGISTER_CALLBACKS == 1)
  /* Store the predeclared callback functions */
  hexti->p_trigger_cb = HAL_EXTI_TriggerCallback;
#endif /* USE_HAL_EXTI_REGISTER_CALLBACKS */

#if defined(USE_HAL_EXTI_USER_DATA) && (USE_HAL_EXTI_USER_DATA == 1)
  hexti->p_user_data = NULL;
#endif /* USE_HAL_EXTI_USER_DATA */

  /* Check if the selected EXTI line is configurable */
  if ((IS_EXTI_CONFIG_LINE((uint32_t)hexti->line)) == 0U)
  {
    hexti->global_state = HAL_EXTI_STATE_ACTIVE;
  }
  else
  {
    hexti->global_state = HAL_EXTI_STATE_INIT;
  }

  return HAL_OK;
}

/**
  * @brief  De-initialize the EXTI line.
  * @param hexti Pointer to EXTI handle.
  */
void HAL_EXTI_DeInit(hal_exti_handle_t *hexti)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM(IS_EXTI_LINE((uint32_t)hexti->line));

  if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
  {
    LL_EXTI_DisableIT_0_31(hexti->ll_line);
    LL_EXTI_DisableEvent_0_31(hexti->ll_line);

    /* Check if the selected EXTI line is a configurable line */
    if (IS_EXTI_CONFIG_LINE((uint32_t)hexti->line) != 0U)
    {
      LL_EXTI_DisableRisingTrig_0_31(hexti->ll_line);
      LL_EXTI_DisableFallingTrig_0_31(hexti->ll_line);
      LL_EXTI_ClearRisingFlag_0_31(hexti->ll_line);
      LL_EXTI_ClearFallingFlag_0_31(hexti->ll_line);
    }
  }

  else
  {
    LL_EXTI_DisableIT_32_63(hexti->ll_line);
    LL_EXTI_DisableEvent_32_63(hexti->ll_line);

    /* Check if the selected EXTI line is a configurable line */
    if (IS_EXTI_CONFIG_LINE((uint32_t)hexti->line) != 0U)
    {
      LL_EXTI_DisableRisingTrig_32_63(hexti->ll_line);
      LL_EXTI_DisableFallingTrig_32_63(hexti->ll_line);
      LL_EXTI_ClearRisingFlag_32_63(hexti->ll_line);
      LL_EXTI_ClearFallingFlag_32_63(hexti->ll_line);
    }
  }

  /* Verify if the selected line is a GPIO line */
  if (((uint32_t)hexti->line & LL_EXTI_GPIO) == LL_EXTI_GPIO)
  {
    /* Reset the EXTI source */
    LL_EXTI_SetEXTISource((uint32_t)HAL_EXTI_GPIOA, ((uint32_t)hexti->line & EXTI_PIN_MASK));
  }

  hexti->global_state = HAL_EXTI_STATE_RESET;
}

/**
  * @brief  Set configuration for the selected EXTI line.
  * @param hexti Pointer to EXTI handle.
  * @param p_exti_config Pointer to EXTI configuration structure.
  * @retval HAL_INVALID_PARAM In case of an invalid parameter.
  * @retval HAL_OK In case of a successful configuration.
  * @retval HAL_ERROR In case of selected EXTI line is direct.
  */
hal_status_t HAL_EXTI_SetConfig(hal_exti_handle_t *hexti, const hal_exti_config_t *p_exti_config)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM(p_exti_config != NULL);
  ASSERT_DBG_PARAM(IS_EXTI_CONFIG_LINE((uint32_t)hexti->line));
  ASSERT_DBG_PARAM(IS_EXTI_TRIGGER(p_exti_config->trigger));

  ASSERT_DBG_STATE(hexti->global_state, (uint32_t)HAL_EXTI_STATE_INIT | (uint32_t)HAL_EXTI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_exti_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check if selected EXTI line is configurable */
  if (IS_EXTI_CONFIG_LINE((uint32_t)hexti->line) == 0U)
  {
    return HAL_ERROR;
  }

  /* Check whether selected trigger is on rising edge */
  if (((uint32_t)p_exti_config->trigger & (uint32_t)HAL_EXTI_TRIGGER_RISING) != 0U)
  {
    if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
    {
      LL_EXTI_EnableRisingTrig_0_31(hexti->ll_line);
    }
    else
    {
      LL_EXTI_EnableRisingTrig_32_63(hexti->ll_line);
    }
  }
  else
  {
    if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
    {
      LL_EXTI_DisableRisingTrig_0_31(hexti->ll_line);
    }
    else
    {
      LL_EXTI_DisableRisingTrig_32_63(hexti->ll_line);
    }
  }

  /* Check whether selected trigger is on falling edge */
  if (((uint32_t)p_exti_config->trigger & (uint32_t)HAL_EXTI_TRIGGER_FALLING) != 0U)
  {
    if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
    {
      LL_EXTI_EnableFallingTrig_0_31(hexti->ll_line);
    }
    else
    {
      LL_EXTI_EnableFallingTrig_32_63(hexti->ll_line);
    }
  }
  else
  {
    if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
    {
      LL_EXTI_DisableFallingTrig_0_31(hexti->ll_line);
    }
    else
    {
      LL_EXTI_DisableFallingTrig_32_63(hexti->ll_line);
    }
  }

  /* Verify if the selected line is a GPIO line */
  if (((uint32_t)hexti->line & LL_EXTI_GPIO) == LL_EXTI_GPIO)
  {
    ASSERT_DBG_PARAM(IS_EXTI_GPIO_PORT(p_exti_config->gpio_port));

