MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_exti.c
    /* Compute the EXTI source register and configure the corresponding GPIO port */
    LL_EXTI_SetEXTISource((uint32_t)p_exti_config->gpio_port, ((uint32_t)hexti->line & EXTI_PIN_MASK));
  }

  hexti->global_state = HAL_EXTI_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Retrieve the configuration of the selected EXTI line.
  * @param hexti Pointer to EXTI handle.
  * @param p_exti_config Pointer to structure to store EXTI configuration.
  */
void HAL_EXTI_GetConfig(const hal_exti_handle_t *hexti, hal_exti_config_t *p_exti_config)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM(p_exti_config != NULL);
  ASSERT_DBG_PARAM(IS_EXTI_CONFIG_LINE((uint32_t)hexti->line));

  ASSERT_DBG_STATE(hexti->global_state, (uint32_t)HAL_EXTI_STATE_IDLE | (uint32_t)HAL_EXTI_STATE_ACTIVE);

  p_exti_config->trigger = HAL_EXTI_TRIGGER_NONE;

  /* Check if the selected EXTI line is configurable */
  if (IS_EXTI_CONFIG_LINE((uint32_t)hexti->line) != 0U)
  {
    /* Check if rising edge trigger is enabled on the selected line */
    if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
    {
      if (LL_EXTI_IsEnabledRisingTrig_0_31(hexti->ll_line) != 0U)
      {
        p_exti_config->trigger = HAL_EXTI_TRIGGER_RISING;
      }
      if (LL_EXTI_IsEnabledFallingTrig_0_31(hexti->ll_line) != 0U)
      {
        if (p_exti_config->trigger == HAL_EXTI_TRIGGER_RISING)
        {
          p_exti_config->trigger = HAL_EXTI_TRIGGER_RISING_FALLING;
        }
        else
        {
          p_exti_config->trigger = HAL_EXTI_TRIGGER_FALLING;
        }
      }
    }
    else
    {
      if (LL_EXTI_IsEnabledRisingTrig_32_63(hexti->ll_line) != 0U)
      {
        p_exti_config->trigger = HAL_EXTI_TRIGGER_RISING;
      }
      if (LL_EXTI_IsEnabledFallingTrig_32_63(hexti->ll_line) != 0U)
      {
        if (p_exti_config->trigger == HAL_EXTI_TRIGGER_RISING)
        {
          p_exti_config->trigger = HAL_EXTI_TRIGGER_RISING_FALLING;
        }
        else
        {
          p_exti_config->trigger = HAL_EXTI_TRIGGER_FALLING;
        }
      }
    }

    /* Check if the selected line is a GPIO line */
    if (((uint32_t)hexti->line & LL_EXTI_GPIO) == LL_EXTI_GPIO)
    {
      /* Compute the EXTI source register and retrieve the actual GPIO port */
      p_exti_config->gpio_port = (hal_exti_gpio_port_t)LL_EXTI_GetEXTISource((uint32_t)hexti->line & EXTI_PIN_MASK);
    }
  }
}

/**
  * @}
  */

/** @addtogroup EXTI_Exported_Functions_Group2
  * @{
  * ## This subsection describes the APIs that manage I/O operations for EXTI lines:

### Enable the EXTI line for the selected mode: Interrupt, Event or both using HAL_EXTI_Enable():
  - Provide the EXTI handle as a first parameter.
  - Provide an EXTI mode from \ref hal_exti_mode_t as a second parameter.

### Disable EXTI line using HAL_EXTI_Disable():
  - Provide the EXTI handle as a parameter.

### Generate a software interrupt using HAL_EXTI_GenerateSWI():
  - Provide the EXTI handle as a parameter.

### Get interrupt pending edge using HAL_EXTI_GetPending():
  - Provide the EXTI handle as a parameter.

### Clear interrupt pending bit for the given edge using HAL_EXTI_ClearPending():
  - Provide the EXTI handle as the first parameter.
  - Provide the pending edge as the second parameter. \n
<br>
  */

/**
  * @brief  Enable the EXTI mode for the selected EXTI line.
  * @param hexti Pointer to EXTI handle.
  * @param mode EXTI mode. This parameter can be one of the values of @ref hal_exti_mode_t.
  * @retval HAL_OK In case of a successful enable.
  */
hal_status_t HAL_EXTI_Enable(hal_exti_handle_t *hexti, hal_exti_mode_t mode)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM(IS_EXTI_MODE(mode));

  ASSERT_DBG_STATE(hexti->global_state, (uint32_t)HAL_EXTI_STATE_IDLE | (uint32_t)HAL_EXTI_STATE_ACTIVE);

  hexti->global_state = HAL_EXTI_STATE_ACTIVE;

  /* Update the previous state to ACTIVE to save actual state throughout ISR */
  hexti->prev_state = HAL_EXTI_STATE_ACTIVE;

  if (((uint32_t)mode & (uint32_t)HAL_EXTI_MODE_INTERRUPT) != 0U)
  {
    if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
    {
      LL_EXTI_EnableIT_0_31(hexti->ll_line);
    }
    else
    {
      LL_EXTI_EnableIT_32_63(hexti->ll_line);
    }
  }

  if (((uint32_t)mode & (uint32_t)HAL_EXTI_MODE_EVENT) != 0U)
  {
    if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
    {
      LL_EXTI_EnableEvent_0_31(hexti->ll_line);
    }
    else
    {
      LL_EXTI_EnableEvent_32_63(hexti->ll_line);
    }
  }

  return HAL_OK;
}

/**
  * @brief  Disable the EXTI mode for the selected EXTI line.
  * @param hexti Pointer to EXTI handle.
  * @retval HAL_OK In case of a successful disable.
  */
hal_status_t HAL_EXTI_Disable(hal_exti_handle_t *hexti)
{
  ASSERT_DBG_PARAM(hexti != NULL);

  ASSERT_DBG_STATE(hexti->global_state, HAL_EXTI_STATE_ACTIVE);

  if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
  {
    LL_EXTI_DisableIT_0_31(hexti->ll_line);
    LL_EXTI_DisableEvent_0_31(hexti->ll_line);
  }
  else
  {
    LL_EXTI_DisableIT_32_63(hexti->ll_line);
    LL_EXTI_DisableEvent_32_63(hexti->ll_line);
  }

  hexti->global_state = HAL_EXTI_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Generate a software interrupt for the selected EXTI line.
  * @param hexti Pointer to EXTI handle.
  * @retval HAL_OK When software interrupt is successfully generated.
  * @retval HAL_ERROR In case of selected EXTI line is direct.
  */
hal_status_t HAL_EXTI_GenerateSWI(hal_exti_handle_t *hexti)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM((IS_EXTI_CONFIG_LINE((uint32_t)hexti->line)));

  ASSERT_DBG_STATE(hexti->global_state, (uint32_t)HAL_EXTI_STATE_INIT | (uint32_t)HAL_EXTI_STATE_IDLE);

  if (IS_EXTI_CONFIG_LINE((uint32_t)hexti->line) == 0U) /* Check if selected EXTI line is configurable */
  {
    return HAL_ERROR;
  }

  hexti->prev_state = hexti->global_state;

  hexti->global_state = HAL_EXTI_STATE_ACTIVE;

  if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
  {
    LL_EXTI_EnableIT_0_31(hexti->ll_line);

    LL_EXTI_GenerateSWI_0_31(hexti->ll_line);
  }
  else
  {
    LL_EXTI_EnableIT_32_63(hexti->ll_line);

    LL_EXTI_GenerateSWI_32_63(hexti->ll_line);
  }

  return HAL_OK;
}

/**
  * @brief  Get interrupt pending bit of the selected EXTI line.
  * @param hexti Pointer to EXTI handle.
  * @retval pending_edge of type @ref hal_exti_trigger_t Trigger value.
  */
hal_exti_trigger_t HAL_EXTI_GetPending(const hal_exti_handle_t *hexti)
{
  hal_exti_trigger_t pending_edge = HAL_EXTI_TRIGGER_NONE;

