MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_exti.c
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM((IS_EXTI_CONFIG_LINE((uint32_t)hexti->line)));

  ASSERT_DBG_STATE(hexti->global_state, (uint32_t)HAL_EXTI_STATE_IDLE | (uint32_t)HAL_EXTI_STATE_ACTIVE);

  /* Check if the selected EXTI line is configurable */
  if (IS_EXTI_CONFIG_LINE((uint32_t)hexti->line) != 0U)
  {
    if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
    {
      /* Check if rising edge trigger is pending */
      if (LL_EXTI_IsActiveRisingFlag_0_31(hexti->ll_line) != 0UL)
      {
        /* Rising edge trigger is pending */
        pending_edge = HAL_EXTI_TRIGGER_RISING;
      }
      /* Check if falling edge trigger is pending */
      if (LL_EXTI_IsActiveFallingFlag_0_31(hexti->ll_line) != 0UL)
      {
        if (pending_edge == HAL_EXTI_TRIGGER_RISING)
        {
          pending_edge = HAL_EXTI_TRIGGER_RISING_FALLING;
        }
        else
        {
          pending_edge = HAL_EXTI_TRIGGER_FALLING;
        }
      }
    }
    else
    {
      /* Check if rising edge trigger is pending */
      if (LL_EXTI_IsActiveRisingFlag_32_63(hexti->ll_line) != 0UL)
      {
        /* Rising edge trigger is pending */
        pending_edge = HAL_EXTI_TRIGGER_RISING;
      }
      /* Check if falling edge trigger is pending */
      if (LL_EXTI_IsActiveFallingFlag_32_63(hexti->ll_line) != 0UL)
      {
        if (pending_edge == HAL_EXTI_TRIGGER_RISING)
        {
          pending_edge = HAL_EXTI_TRIGGER_RISING_FALLING;
        }
        else
        {
          pending_edge = HAL_EXTI_TRIGGER_FALLING;
        }
      }
    }
  }

  return (pending_edge);
}


/**
  * @brief  Clear interrupt pending bit of the selected EXTI line.
  * @param hexti Pointer to EXTI handle.
  * @param edge Pending edge to be cleared. This parameter can be one of the values of
  *             @ref hal_exti_trigger_t Trigger value.
  */
void HAL_EXTI_ClearPending(const hal_exti_handle_t *hexti, hal_exti_trigger_t edge)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM((IS_EXTI_CONFIG_LINE((uint32_t)hexti->line)));
  ASSERT_DBG_PARAM(IS_EXTI_PENDING_EDGE(edge));

  ASSERT_DBG_STATE(hexti->global_state, (uint32_t)HAL_EXTI_STATE_IDLE | (uint32_t)HAL_EXTI_STATE_ACTIVE);

  /* Check if the selected EXTI line is configurable */
  if (IS_EXTI_CONFIG_LINE((uint32_t)hexti->line) != 0U)
  {
    if (((uint32_t)edge & (uint32_t)HAL_EXTI_TRIGGER_RISING) != 0UL)
    {
      /* Clear rising edge trigger pending bit */
      if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
      {
        LL_EXTI_ClearRisingFlag_0_31(hexti->ll_line);
      }
      else
      {
        LL_EXTI_ClearRisingFlag_32_63(hexti->ll_line);
      }
    }

    if (((uint32_t)edge & (uint32_t)HAL_EXTI_TRIGGER_FALLING) != 0UL)
    {
      /* Clear falling edge trigger pending bit */
      if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
      {
        LL_EXTI_ClearFallingFlag_0_31(hexti->ll_line);
      }
      else
      {
        LL_EXTI_ClearFallingFlag_32_63(hexti->ll_line);
      }
    }
  }
}
/**
  * @}
  */

/** @addtogroup EXTI_Exported_Functions_Group3
  * @{
  * ## This subsection contains the EXTI IRQHandler and callback registration functions:

### Handle EXTI interrupt requests using HAL_EXTI_IRQHandler():
  - Provide the EXTI handle as a parameter.

### Register callback function for interrupts on trigger edge using HAL_EXTI_RegisterTriggerCallback():
  - Provide the EXTI handle as the first parameter.
  - Provide a pointer to the callback function as the second parameter.

### Default callback function for interrupts on trigger edge using HAL_EXTI_TriggerCallback():
  - Provide the EXTI handle as a parameter.
  - Provide the trigger as the second parameter.

### Store user data pointer into the handle using HAL_EXTI_SetUserData():
  - Provide the EXTI handle as the first parameter.
  - Provide the pointer to the user data as the second parameter.

### Retrieve user data pointer from the handle using HAL_EXTI_GetUserData():
  - Provide the EXTI handle as a parameter. \n
<br>
  */

/**
  * @brief  Handle EXTI interrupt requests.
  * @param hexti Pointer to EXTI handle.
  */
void HAL_EXTI_IRQHandler(hal_exti_handle_t *hexti)
{
  hal_exti_trigger_t trigger = HAL_EXTI_TRIGGER_NONE;

  /* Check if previous state is not ACTIVE; the interrupt follows a HAL_EXTI_GenerateSWI call.
  Note that when HAL_EXTI_Enable is called, both global state and previous state are set to ACTIVE. */
  if (hexti->prev_state != HAL_EXTI_STATE_ACTIVE)
  {
    if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
    {
      LL_EXTI_DisableIT_0_31(hexti->ll_line);
    }
    else
    {
      LL_EXTI_DisableIT_32_63(hexti->ll_line);
    }

    /* Restore the previous state */
    hexti->global_state = hexti->prev_state;
  }

  if (((uint32_t)hexti->line & LL_EXTI_REG1) == LL_EXTI_REG1)
  {
    if (LL_EXTI_IsActiveRisingFlag_0_31(hexti->ll_line) != 0UL)
    {
      LL_EXTI_ClearRisingFlag_0_31(hexti->ll_line);

      trigger = HAL_EXTI_TRIGGER_RISING;
    }

    if (LL_EXTI_IsActiveFallingFlag_0_31(hexti->ll_line) != 0UL)
    {
      LL_EXTI_ClearFallingFlag_0_31(hexti->ll_line);

      trigger = ((trigger == HAL_EXTI_TRIGGER_RISING) ? HAL_EXTI_TRIGGER_RISING_FALLING : HAL_EXTI_TRIGGER_FALLING);
    }
  }
  else
  {
    if (LL_EXTI_IsActiveRisingFlag_32_63(hexti->ll_line) != 0UL)
    {
      LL_EXTI_ClearRisingFlag_32_63(hexti->ll_line);

      trigger = HAL_EXTI_TRIGGER_RISING;
    }

    if (LL_EXTI_IsActiveFallingFlag_32_63(hexti->ll_line) != 0UL)
    {
      LL_EXTI_ClearFallingFlag_32_63(hexti->ll_line);

      trigger = ((trigger == HAL_EXTI_TRIGGER_RISING) ? HAL_EXTI_TRIGGER_RISING_FALLING : HAL_EXTI_TRIGGER_FALLING);
    }
  }

  if (trigger != HAL_EXTI_TRIGGER_NONE)
  {
#if defined (USE_HAL_EXTI_REGISTER_CALLBACKS) && (USE_HAL_EXTI_REGISTER_CALLBACKS == 1)
    hexti->p_trigger_cb(hexti, trigger);
#else
    HAL_EXTI_TriggerCallback(hexti, trigger);
#endif /* USE_HAL_EXTI_REGISTER_CALLBACKS */
  }
}

#if defined (USE_HAL_EXTI_REGISTER_CALLBACKS) && (USE_HAL_EXTI_REGISTER_CALLBACKS == 1)

/**
  * @brief  Register callback function for the selected EXTI line on trigger edge.
  * @param hexti Pointer to EXTI handle.
  * @param p_exti_cb Pointer to the callback function to be registered.
  * @retval HAL_INVALID_PARAM In case of an invalid parameter.
  * @retval HAL_OK In case of a successful callback registration.
  */
hal_status_t HAL_EXTI_RegisterTriggerCallback(hal_exti_handle_t *hexti, hal_exti_cb_t p_exti_cb)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM(p_exti_cb != NULL);
  ASSERT_DBG_PARAM((IS_EXTI_CONFIG_LINE((uint32_t)hexti->line)));

  ASSERT_DBG_STATE(hexti->global_state, (uint32_t)HAL_EXTI_STATE_INIT | (uint32_t)HAL_EXTI_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_exti_cb == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

