MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_exti.c
  if (IS_EXTI_CONFIG_LINE((uint32_t)hexti->line) == 0U) /* Check if selected EXTI line is configurable */
  {
    return HAL_ERROR;
  }

  hexti->p_trigger_cb = p_exti_cb;

  return HAL_OK;
}
#endif /* USE_HAL_EXTI_REGISTER_CALLBACKS */

/**
  * @brief  EXTI line trigger edge default callback.
  * @param hexti Pointer to EXTI handle.
  * @param trigger This parameter can be one of the values of @ref hal_exti_trigger_t Trigger value.
  */
__WEAK void HAL_EXTI_TriggerCallback(hal_exti_handle_t *hexti, hal_exti_trigger_t trigger)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hexti);
  STM32_UNUSED(trigger);

  /*! <b>NOTE:</b> This function must not be modified. When the callback is needed,
              the HAL_EXTI_TriggerCallback can be implemented in the user file.
   */
}

#if defined (USE_HAL_EXTI_USER_DATA) && (USE_HAL_EXTI_USER_DATA == 1)

/**
  * @brief Store the user data pointer in the handle.
  * @param hexti Pointer to EXTI handle.
  * @param p_user_data Pointer to the user data.
  */
void HAL_EXTI_SetUserData(hal_exti_handle_t *hexti, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hexti != NULL);

  hexti->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data pointer from the handle.
  * @param hexti Pointer to EXTI handle.
  * @retval Pointer to the user data.
  */
const void *HAL_EXTI_GetUserData(const hal_exti_handle_t *hexti)
{
  ASSERT_DBG_PARAM(hexti != NULL);

  return (hexti->p_user_data);
}

#endif /* USE_HAL_EXTI_USER_DATA */
/**
  * @}
  */

/** @addtogroup EXTI_Exported_Functions_Group4
  * @{
  * ## This subsection contains the EXTI state and info functions:

### Retrieve the global state of the current EXTI line using HAL_EXTI_GetState():
  - Provide the EXTI handle as a parameter.

### Retrieve the HAL EXTI line using HAL_EXTI_GetInstance():
  - Provide the EXTI handle as a parameter.

### Retrieve the LL EXTI line using HAL_EXTI_GetLLInstance():
  - Provide the EXTI handle as a parameter.
  */

/**
  * @brief  Get the current general state of the EXTI line.
  * @param hexti Pointer to EXTI handle.
  * @retval HAL_EXTI_STATE_RESET when EXTI is de-initialized.
  * @retval HAL_EXTI_STATE_INIT when EXTI is initialized but not yet configured.
  * @retval HAL_EXTI_STATE_IDLE when EXTI is initialized and configured.
  * @retval HAL_EXTI_STATE_ACTIVE when EXTI is initialized, configured, and enabled.
  */
hal_exti_state_t HAL_EXTI_GetState(const hal_exti_handle_t *hexti)
{
  ASSERT_DBG_PARAM(hexti != NULL);

  return hexti->global_state;
}

/**
  * @brief  Get the HAL EXTI line.
  * @param  hexti Pointer to a \ref hal_exti_handle_t structure.
  * @retval The HAL EXTI line.
  */
hal_exti_line_t HAL_EXTI_GetInstance(const hal_exti_handle_t *hexti)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM(IS_EXTI_LINE((uint32_t)hexti->line));

  return (hexti->line);
}

/**
  * @brief  Get the LL instance from the handle.
  * @param  hexti Pointer to a \ref hal_exti_handle_t structure.
  * @retval The LL EXTI Line.
  */
uint32_t HAL_EXTI_GetLLInstance(const hal_exti_handle_t *hexti)
{
  ASSERT_DBG_PARAM(hexti != NULL);
  ASSERT_DBG_PARAM(IS_EXTI_LINE((uint32_t)hexti->line));

  return (hexti->ll_line);
}
/**
  * @}
  */

/** @addtogroup EXTI_Exported_Functions_Group5
  * @{
  * ## This subsection contains EXTI security attributes management functions:

### Set the EXTI line privilege attribute using HAL_EXTI_SetPrivAttr():
  - Provide the EXTI line as first parameter.
  - Provide the EXTI privilege attribute as second parameter.

### Get the EXTI line privilege attribute using HAL_EXTI_GetPrivAttr():
  - Provide the EXTI line as first parameter.
  */

/**
  * @brief  Set the privileged access level attribute for an EXTI line.
  * @param exti_line This parameter can be a value of @ref hal_exti_line_t.
  * @param priv_attr This parameter can be one of the following values:
  *         @arg @ref HAL_EXTI_PRIV
  *         @arg @ref HAL_EXTI_NPRIV
  * @retval HAL_OK Privilege attribute has been set successfully
  * @retval HAL_ERROR Non-privileged write to a privileged-only register.
  */
hal_status_t HAL_EXTI_SetPrivAttr(hal_exti_line_t exti_line, hal_exti_priv_attr_t priv_attr)
{
  uint32_t ll_exti_line;

  ASSERT_DBG_PARAM(IS_EXTI_LINE((uint32_t)exti_line));
  ASSERT_DBG_PARAM(IS_EXTI_LINE_PRIV_ATTR(priv_attr));

  ll_exti_line = 1UL << ((uint32_t)exti_line & LL_EXTI_PIN_MASK);

  if (STM32_IS_PRIVILEGED_EXECUTION() == 0U)
  {
    return HAL_ERROR;
  }

  if (((uint32_t)exti_line & LL_EXTI_REG1) == LL_EXTI_REG1)
  {
    LL_EXTI_SetPrivAttr_0_31(ll_exti_line, (uint32_t)priv_attr);
  }
  else
  {
    LL_EXTI_SetPrivAttr_32_63(ll_exti_line, (uint32_t)priv_attr);
  }

  return HAL_OK;
}

/**
  * @brief  Get the privileged access level attribute for an EXTI line.
  * @param exti_line This parameter can be one of the values of @ref hal_exti_line_t.
  * @retval The returned value can be one of the following values:
  *         @arg @ref HAL_EXTI_PRIV
  *         @arg @ref HAL_EXTI_NPRIV
  */
hal_exti_priv_attr_t HAL_EXTI_GetPrivAttr(hal_exti_line_t exti_line)
{
  uint32_t ll_exti_line;

  ASSERT_DBG_PARAM(IS_EXTI_LINE((uint32_t)exti_line));

  ll_exti_line = 1UL << ((uint32_t)exti_line & LL_EXTI_PIN_MASK);

  if (((uint32_t)exti_line & LL_EXTI_REG1) == LL_EXTI_REG1)
  {
    return ((hal_exti_priv_attr_t)LL_EXTI_GetPrivAttr_0_31(ll_exti_line));
  }
  else
  {
    return ((hal_exti_priv_attr_t)LL_EXTI_GetPrivAttr_32_63(ll_exti_line));
  }
}
/**
  * @}
  */
/**
  * @}
  */
/**
  * @}
  */

#endif /* USE_HAL_EXTI_MODULE */
#endif /* EXTI */
/**
  * @}
  */
